# ParameterFilterUtilities Members

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ParameterFilterUtilities Members
ParameterFilterUtilities Class Methods See Also
---
The ParameterFilterUtilities type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| GetAllFilterableCategories | Returns the set of categories that may be used in a ParameterFilterElement. |
| GetFilterableParametersInCommon | Returns the filterable parameters common to the given categories. |
| GetInapplicableParameters | Returns the parameters that are not among the set of filterable parameters common to the given categories. |
| IsParameterApplicable | Used to determine whether the element supports the given parameter. |
| RemoveUnfilterableCategories | Removes from the given set the categories that are not filterable. |

# See Also
ParameterFilterUtilities Class
Autodesk.Revit.DB Namespace